stevenj/avr-libc3/include/avr/io/atmega8hva.h
/* Watchdog Reset Flag */
#define CPU_WDRF_CLEAR_gc (0x00) /* Watchdog Reset Flag - CLEAR */
#define CPU_WDRF_SET_gc   (0x08) /* Watchdog Reset Flag - SET */


/* Brown-out Reset Flag */
#define CPU_BODRF_CLEAR_gc (0x00) /* Brown-out Reset Flag - CLEAR */
#define CPU_BODRF_SET_gc   (0x04) /* Brown-out Reset Flag - SET */


/* External Reset Flag */
#define CPU_EXTRF_CLEAR_gc (0x00) /* External Reset Flag - CLEAR */
#define CPU_EXTRF_SET_gc   (0x02) /* External Reset Flag - SET */


/* Power-on reset flag */
#define CPU_PORF_CLEAR_gc (0x00) /* Power-on reset flag - CLEAR */
#define CPU_PORF_SET_gc   (0x01) /* Power-on reset flag - SET */


/* Oscillator Sampling Interface Select 0 */
#define CPU_OSISEL0_CLEAR_gc (0x00) /* Oscillator Sampling Interface Select 0 - CLEAR */
#define CPU_OSISEL0_SET_gc   (0x10) /* Oscillator Sampling Interface Select 0 - SET */


/* Oscillator Sampling Interface Status */
#define CPU_OSIST_CLEAR_gc (0x00) /* Oscillator Sampling Interface Status - CLEAR */
#define CPU_OSIST_SET_gc   (0x02) /* Oscillator Sampling Interface Status - SET */


/* Oscillator Sampling Interface Enable */
#define CPU_OSIEN_CLEAR_gc (0x00) /* Oscillator Sampling Interface Enable - CLEAR */
#define CPU_OSIEN_SET_gc   (0x01) /* Oscillator Sampling Interface Enable - SET */


/* Sleep Mode Select bits */
#define CPU_SM_IDLE_gc     (0x00<<1) /* Idle */
#define CPU_SM_ADC_gc      (0x01<<1) /* ADC Noise Reduction (If Available) */
#define CPU_SM_VAL_0x02_gc (0x02<<1) /* Reserved */
#define CPU_SM_PSAVE_gc    (0x03<<1) /* Power Save */
#define CPU_SM_POFF_gc     (0x04<<1) /* Power Off */
#define CPU_SM_VAL_0x05_gc (0x05<<1) /* Reserved */
#define CPU_SM_VAL_0x06_gc (0x06<<1) /* Reserved */
#define CPU_SM_VAL_0x07_gc (0x07<<1) /* Reserved */


/* Sleep Enable */
#define CPU_SE_CLEAR_gc (0x00) /* Sleep Enable - CLEAR */
#define CPU_SE_SET_gc   (0x01) /* Sleep Enable - SET */


/* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. */
#define CPU_PA1DID_CLEAR_gc (0x00) /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - CLEAR */
#define CPU_PA1DID_SET_gc   (0x02) /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - SET */


/* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. */
#define CPU_PA0DID_CLEAR_gc (0x00) /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - CLEAR */
#define CPU_PA0DID_SET_gc   (0x01) /* When this bit is written logic one, the digital input buffer of the corresponding V_ADC pin is disabled. - SET */


/* Power Reduction Voltage Regulator Monitor */
#define CPU_PRVRM_CLEAR_gc (0x00) /* Power Reduction Voltage Regulator Monitor - CLEAR */
#define CPU_PRVRM_SET_gc   (0x20) /* Power Reduction Voltage Regulator Monitor - SET */


/* Power reduction SPI */
#define CPU_PRSPI_CLEAR_gc (0x00) /* Power reduction SPI - CLEAR */
#define CPU_PRSPI_SET_gc   (0x08) /* Power reduction SPI - SET */


/* Power Reduction Timer/Counter1 */
#define CPU_PRTIM1_CLEAR_gc (0x00) /* Power Reduction Timer/Counter1 - CLEAR */
#define CPU_PRTIM1_SET_gc   (0x04) /* Power Reduction Timer/Counter1 - SET */


/* Power Reduction Timer/Counter0 */
#define CPU_PRTIM0_CLEAR_gc (0x00) /* Power Reduction Timer/Counter0 - CLEAR */
#define CPU_PRTIM0_SET_gc   (0x02) /* Power Reduction Timer/Counter0 - SET */


/* Power Reduction V-ADC */
#define CPU_PRVADC_CLEAR_gc (0x00) /* Power Reduction V-ADC - CLEAR */
#define CPU_PRVADC_SET_gc   (0x01) /* Power Reduction V-ADC - SET */


/* Clock Prescaler Change Enable */
#define CPU_CLKPCE_CLEAR_gc (0x00) /* Clock Prescaler Change Enable - CLEAR */
#define CPU_CLKPCE_SET_gc   (0x80) /* Clock Prescaler Change Enable - SET */


/* Clock Prescaler Select Bits */
#define CPU_CLKPR_CLKPS_gc(x) (x & 0x03)

/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/


/* Battery Protection Parameter Lock Enable */
#define BATTERY_PROTECTION_BPPLE_CLEAR_gc (0x00) /* Battery Protection Parameter Lock Enable - CLEAR */
#define BATTERY_PROTECTION_BPPLE_SET_gc   (0x02) /* Battery Protection Parameter Lock Enable - SET */


/* Battery Protection Parameter Lock */
#define BATTERY_PROTECTION_BPPL_CLEAR_gc (0x00) /* Battery Protection Parameter Lock - CLEAR */
#define BATTERY_PROTECTION_BPPL_SET_gc   (0x01) /* Battery Protection Parameter Lock - SET */


/* Short Circuit Protection Disabled */
#define BATTERY_PROTECTION_SCD_CLEAR_gc (0x00) /* Short Circuit Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_SCD_SET_gc   (0x10) /* Short Circuit Protection Disabled - SET */


/* Discharge Over-current Protection Disabled */
#define BATTERY_PROTECTION_DOCD_CLEAR_gc (0x00) /* Discharge Over-current Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_DOCD_SET_gc   (0x08) /* Discharge Over-current Protection Disabled - SET */


/* Charge Over-current Protection Disabled */
#define BATTERY_PROTECTION_COCD_CLEAR_gc (0x00) /* Charge Over-current Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_COCD_SET_gc   (0x04) /* Charge Over-current Protection Disabled - SET */


/* Discharge High-current Protection Disable */
#define BATTERY_PROTECTION_DHCD_CLEAR_gc (0x00) /* Discharge High-current Protection Disable - CLEAR */
#define BATTERY_PROTECTION_DHCD_SET_gc   (0x02) /* Discharge High-current Protection Disable - SET */


/* Charge High-current Protection Disable */
#define BATTERY_PROTECTION_CHCD_CLEAR_gc (0x00) /* Charge High-current Protection Disable - CLEAR */
#define BATTERY_PROTECTION_CHCD_SET_gc   (0x01) /* Charge High-current Protection Disable - SET */


/* Short-circuit Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_SCIF_CLEAR_gc (0x00) /* Short-circuit Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_SCIF_SET_gc   (0x10) /* Short-circuit Protection Activated Interrupt Flag - SET */


/* Discharge Over-current Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_DOCIF_CLEAR_gc (0x00) /* Discharge Over-current Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_DOCIF_SET_gc   (0x08) /* Discharge Over-current Protection Activated Interrupt Flag - SET */


/* Charge Over-current Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_COCIF_CLEAR_gc (0x00) /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_COCIF_SET_gc   (0x04) /* Charge Over-current Protection Activated Interrupt Flag - SET */


/* Disharge High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_DHCIF_CLEAR_gc (0x00) /* Disharge High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_DHCIF_SET_gc   (0x02) /* Disharge High-current Protection Activated Interrupt - SET */


/* Charge High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_CHCIF_CLEAR_gc (0x00) /* Charge High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_CHCIF_SET_gc   (0x01) /* Charge High-current Protection Activated Interrupt - SET */


/* Short-circuit Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_SCIE_CLEAR_gc (0x00) /* Short-circuit Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_SCIE_SET_gc   (0x10) /* Short-circuit Protection Activated Interrupt Enable - SET */


/* Discharge Over-current Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_DOCIE_CLEAR_gc (0x00) /* Discharge Over-current Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_DOCIE_SET_gc   (0x08) /* Discharge Over-current Protection Activated Interrupt Enable - SET */


