stevenj/avr-libc3/include/avr/io/atmega8hva.h
/*
--------------------------------------------------------------------------------
VOLTAGE_REGULATOR - Voltage Regulator
--------------------------------------------------------------------------------
*/


/* ROC Status */
#define VOLTAGE_REGULATOR_ROCS_CLEAR_gc (0x00) /* ROC Status - CLEAR */
#define VOLTAGE_REGULATOR_ROCS_SET_gc   (0x80) /* ROC Status - SET */


/* ROC Warning Interrupt Flag */
#define VOLTAGE_REGULATOR_ROCWIF_CLEAR_gc (0x00) /* ROC Warning Interrupt Flag - CLEAR */
#define VOLTAGE_REGULATOR_ROCWIF_SET_gc   (0x02) /* ROC Warning Interrupt Flag - SET */


/* ROC Warning Interrupt Enable */
#define VOLTAGE_REGULATOR_ROCWIE_CLEAR_gc (0x00) /* ROC Warning Interrupt Enable - CLEAR */
#define VOLTAGE_REGULATOR_ROCWIE_SET_gc   (0x01) /* ROC Warning Interrupt Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE                  _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_VADC                  _SFR_MEM16(0x0078) /* VADC Data Register  Bytes */
#define ADC_VADCL                 _SFR_MEM8 (0x0078) /* VADC Data Register  Bytes LOW BYTE */
#define ADC_VADCH                 _SFR_MEM8 (0x0079) /* VADC Data Register  Bytes HIGH BYTE */
#define ADC_VADCSR                _SFR_MEM8 (0x007A) /* The VADC Control and Status register */
#define ADC_VADMUX                _SFR_MEM8 (0x007C) /* The VADC multiplexer Selection Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE                  _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR                _SFR_MEM8 (0x0060) /* Watchdog Timer Control Register */

/* BANDGAP - Bandgap (0x0000) */
#define BANDGAP_BASE              _SFR_MEM8 (0x0000) /* BANDGAP Base Address */
#define BANDGAP_BGCCR             _SFR_MEM8 (0x00D0) /* Bandgap Calibration Register */
#define BANDGAP_BGCRR             _SFR_MEM8 (0x00D1) /* Bandgap Calibration of Resistor Ladder */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE                _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_EIFR                _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK               _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_EICRA               _SFR_MEM8 (0x0069) /* External Interrupt Control Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE               _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC               _SFR_MEM8 (0x0026) /* Port C Input Pins */
#define PORTCC_PORTC              _SFR_MEM8 (0x0028) /* Port C Data Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE               _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA               _SFR_MEM8 (0x0020) /* Port A Input Pins */
#define PORTAA_DDRA               _SFR_MEM8 (0x0021) /* Port A Data Direction Register */
#define PORTAA_PORTA              _SFR_MEM8 (0x0022) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE               _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB               _SFR_MEM8 (0x0023) /* Input Pins, Port B */
#define PORTBB_DDRB               _SFR_MEM8 (0x0024) /* Data Direction Register, Port B */
#define PORTBB_PORTB              _SFR_MEM8 (0x0025) /* Data Register, Port B */

/* FET - FET Control (0x0000) */
#define FET_BASE                  _SFR_MEM8 (0x0000) /* FET Base Address */
#define FET_FCSR                  _SFR_MEM8 (0x00F0) /* FET Control and Status Register */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE                  _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR                  _SFR_MEM8 (0x004C) /* SPI Control Register */
#define SPI_SPSR                  _SFR_MEM8 (0x004D) /* SPI Status Register */
#define SPI_SPDR                  _SFR_MEM8 (0x004E) /* SPI Data Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE            _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR          _SFR_MEM8 (0x0057) /* Store Program Memory Control and Status Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE                  _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_OSICSR                _SFR_MEM8 (0x0037) /* Oscillator Sampling Interface Control and Status Register */
#define CPU_GPIOR0                _SFR_MEM8 (0x003E) /* General Purpose IO Register 0 */
#define CPU_GPIOR1                _SFR_MEM8 (0x004A) /* General Purpose IO Register 1 */
#define CPU_GPIOR2                _SFR_MEM8 (0x004B) /* General Purpose IO Register 2 */
#define CPU_SMCR                  _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR                 _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR                 _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP                    _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL                   _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH                   _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG                  _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_CLKPR                 _SFR_MEM8 (0x0061) /* Clock Prescale Register */
#define CPU_PRR0                  _SFR_MEM8 (0x0064) /* Power Reduction Register 0 */
#define CPU_FOSCCAL               _SFR_MEM8 (0x0066) /* Fast Oscillator Calibration Value */
#define CPU_DIDR0                 _SFR_MEM8 (0x007E) /* Digital Input Disable Register */

/* BATTERY_PROTECTION - Battery Protection (0x0000) */
#define BATTERY_PROTECTION_BASE   _SFR_MEM8 (0x0000) /* BATTERY_PROTECTION Base Address */
#define BATTERY_PROTECTION_BPIMSK _SFR_MEM8 (0x00F2) /* Battery Protection Interrupt Mask Register */
#define BATTERY_PROTECTION_BPIFR  _SFR_MEM8 (0x00F3) /* Battery Protection Interrupt Flag Register */
#define BATTERY_PROTECTION_BPSCD  _SFR_MEM8 (0x00F5) /* Battery Protection Short-Circuit Detection Level Register */
#define BATTERY_PROTECTION_BPDOCD _SFR_MEM8 (0x00F6) /* Battery Protection Discharge-Over-current Detection Level Register */
#define BATTERY_PROTECTION_BPCOCD _SFR_MEM8 (0x00F7) /* Battery Protection Charge-Over-current Detection Level Register */
#define BATTERY_PROTECTION_BPDHCD _SFR_MEM8 (0x00F8) /* Battery Protection Discharge-High-current Detection Level Register */
#define BATTERY_PROTECTION_BPCHCD _SFR_MEM8 (0x00F9) /* Battery Protection Charge-High-current Detection Level Register */
#define BATTERY_PROTECTION_BPSCTR _SFR_MEM8 (0x00FA) /* Battery Protection Short-current Timing Register */
#define BATTERY_PROTECTION_BPOCTR _SFR_MEM8 (0x00FB) /* Battery Protection Over-current Timing Register */
#define BATTERY_PROTECTION_BPHCTR _SFR_MEM8 (0x00FC) /* Battery Protection Short-current Timing Register */
#define BATTERY_PROTECTION_BPCR   _SFR_MEM8 (0x00FD) /* Battery Protection Control Register */
#define BATTERY_PROTECTION_BPPLR  _SFR_MEM8 (0x00FE) /* Battery Protection Parameter Lock Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE               _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR               _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR               _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEAR               _SFR_MEM8 (0x0041) /* EEPROM Read/Write Access */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE                 _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1                _SFR_MEM8 (0x0036) /* Timer/Counter Interrupt Flag register */
#define TC16_GTCCR                _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC16_TIMSK1               _SFR_MEM8 (0x006F) /* Timer/Counter Interrupt Mask Register */
#define TC16_TCCR1A               _SFR_MEM8 (0x0080) /* Timer/Counter 1 Control Register A */
#define TC16_TCCR1B               _SFR_MEM8 (0x0081) /* Timer/Counter1 Control Register B */
#define TC16_TCNT1                _SFR_MEM16(0x0084) /* Timer Counter 1  Bytes */
#define TC16_TCNT1L               _SFR_MEM8 (0x0084) /* Timer Counter 1  Bytes LOW BYTE */
#define TC16_TCNT1H               _SFR_MEM8 (0x0085) /* Timer Counter 1  Bytes HIGH BYTE */
#define TC16_OCR1A                _SFR_MEM8 (0x0088) /* Output Compare Register 1A */
#define TC16_OCR1B                _SFR_MEM8 (0x0089) /* Output Compare Register B */

/* TC0 - Timer/Counter, 16-bit (0x0000) */
/* TC16_BASE ALREADY DEFINED */
#define TC16_TIFR0                _SFR_MEM8 (0x0035) /* Timer/Counter Interrupt Flag register */
#define TC16_TCCR0A               _SFR_MEM8 (0x0044) /* Timer/Counter0 Control Register */
#define TC16_TCCR0B               _SFR_MEM8 (0x0045) /* Timer/Counter0 Control Register */
#define TC16_TCNT0                _SFR_MEM16(0x0046) /* Timer Counter 0  Bytes */
#define TC16_TCNT0L               _SFR_MEM8 (0x0046) /* Timer Counter 0  Bytes LOW BYTE */
#define TC16_TCNT0H               _SFR_MEM8 (0x0047) /* Timer Counter 0  Bytes HIGH BYTE */
#define TC16_OCR0A                _SFR_MEM8 (0x0048) /* Output compare Register A */
#define TC16_OCR0B                _SFR_MEM8 (0x0049) /* Output compare Register B */
#define TC16_TIMSK0               _SFR_MEM8 (0x006E) /* Timer/Counter Interrupt Mask Register */

/* COULOMB_COUNTER - Coulomb Counter (0x0000) */
#define COULOMB_COUNTER_BASE      _SFR_MEM8 (0x0000) /* COULOMB_COUNTER Base Address */
#define COULOMB_COUNTER_CADAC0    _SFR_MEM8 (0x00E0) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC1    _SFR_MEM8 (0x00E1) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC2    _SFR_MEM8 (0x00E2) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC3    _SFR_MEM8 (0x00E3) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADCSRA   _SFR_MEM8 (0x00E4) /* CC-ADC Control and Status Register A */
#define COULOMB_COUNTER_CADCSRB   _SFR_MEM8 (0x00E5) /* CC-ADC Control and Status Register B */
#define COULOMB_COUNTER_CADRC     _SFR_MEM8 (0x00E6) /* CC-ADC Regular Current */
#define COULOMB_COUNTER_CADIC     _SFR_MEM16(0x00E8) /* CC-ADC Instantaneous Current */
#define COULOMB_COUNTER_CADICL    _SFR_MEM8 (0x00E8) /* CC-ADC Instantaneous Current LOW BYTE */
#define COULOMB_COUNTER_CADICH    _SFR_MEM8 (0x00E9) /* CC-ADC Instantaneous Current HIGH BYTE */

/* VOLTAGE_REGULATOR - Voltage Regulator (0x0000) */
#define VOLTAGE_REGULATOR_BASE    _SFR_MEM8 (0x0000) /* VOLTAGE_REGULATOR Base Address */
#define VOLTAGE_REGULATOR_ROCR    _SFR_MEM8 (0x00C8) /* Regulator Operating Condition Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE                 _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW                  _SFR_MEM8 (0x0000) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE              _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT           _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

