stevenj/avr-libc3/include/avr/io/atmega8hva.h
/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num         (0)                 
#define None_RESET_vect             _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_BPINT_vect_num         (1)                 
#define None_BPINT_vect             _VECTOR(1)          /* Battery Protection Interrupt */
#define None_VREGMON_vect_num       (2)                 
#define None_VREGMON_vect           _VECTOR(2)          /* Voltage regulator monitor interrupt */
#define None_INT0_vect_num          (3)                 
#define None_INT0_vect              _VECTOR(3)          /* External Interrupt Request 0 */
#define None_INT1_vect_num          (4)                 
#define None_INT1_vect              _VECTOR(4)          /* External Interrupt Request 1 */
#define None_INT2_vect_num          (5)                 
#define None_INT2_vect              _VECTOR(5)          /* External Interrupt Request 2 */
#define None_WDT_vect_num           (6)                 
#define None_WDT_vect               _VECTOR(6)          /* Watchdog Timeout Interrupt */
#define None_TIMER1_IC_vect_num     (7)                 
#define None_TIMER1_IC_vect         _VECTOR(7)          /* Timer 1 Input capture */
#define None_TIMER1_COMPA_vect_num  (8)                 
#define None_TIMER1_COMPA_vect      _VECTOR(8)          /* Timer 1 Compare Match A */
#define None_TIMER1_COMPB_vect_num  (9)                 
#define None_TIMER1_COMPB_vect      _VECTOR(9)          /* Timer 1 Compare Match B */
#define None_TIMER1_OVF_vect_num    (10)                
#define None_TIMER1_OVF_vect        _VECTOR(10)         /* Timer 1 overflow */
#define None_TIMER0_IC_vect_num     (11)                
#define None_TIMER0_IC_vect         _VECTOR(11)         /* Timer 0 Input Capture */
#define None_TIMER0_COMPA_vect_num  (12)                
#define None_TIMER0_COMPA_vect      _VECTOR(12)         /* Timer 0 Comapre Match A */
#define None_TIMER0_COMPB_vect_num  (13)                
#define None_TIMER0_COMPB_vect      _VECTOR(13)         /* Timer 0 Compare Match B */
#define None_TIMER0_OVF_vect_num    (14)                
#define None_TIMER0_OVF_vect        _VECTOR(14)         /* Timer 0 Overflow */
#define None_SPI_STC_vect_num       (15)                
#define None_SPI_STC_vect           _VECTOR(15)         /* SPI Serial transfer complete */
#define None_VADC_vect_num          (16)                
#define None_VADC_vect              _VECTOR(16)         /* Voltage ADC Conversion Complete */
#define None_CCADC_CONV_vect_num    (17)                
#define None_CCADC_CONV_vect        _VECTOR(17)         /* Coulomb Counter ADC Conversion Complete */
#define None_CCADC_REG_CUR_vect_num (18)                
#define None_CCADC_REG_CUR_vect     _VECTOR(18)         /* Coloumb Counter ADC Regular Current */
#define None_CCADC_ACC_vect_num     (19)                
#define None_CCADC_ACC_vect         _VECTOR(19)         /* Coloumb Counter ADC Accumulator */
#define None_EE_READY_vect_num      (20)                
#define None_EE_READY_vect          _VECTOR(20)         /* EEPROM Ready */

/* Vector Table Size */
#define _VECTOR_SIZE                (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE               (21 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START   (0x0000)                           
#define PROGMEM_SIZE    (0x2000)                           
#define PROGMEM_END     (PROGMEM_START + PROGMEM_SIZE - 1) 

#define FLASH_START     (0x0000)                           
#define FLASH_SIZE      (0x2000)                           
#define FLASH_PAGE_SIZE (0x0080)                           
#define FLASH_END       (FLASH_START + FLASH_SIZE - 1)     

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0001)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0001)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

#define DATAMEM_START       (0x0000)                               
#define DATAMEM_SIZE        (0x0300)                               
#define DATAMEM_END         (DATAMEM_START + DATAMEM_SIZE - 1)     

#define REGISTERS_START     (0x0000)                               
#define REGISTERS_SIZE      (0x0020)                               
#define REGISTERS_PAGE_SIZE (0x0001)                               
#define REGISTERS_END       (REGISTERS_START + REGISTERS_SIZE - 1) 

#define MAPPED_IO_START     (0x0020)                               
#define MAPPED_IO_SIZE      (0x00E0)                               
#define MAPPED_IO_PAGE_SIZE (0x0001)                               
#define MAPPED_IO_END       (MAPPED_IO_START + MAPPED_IO_SIZE - 1) 

#define IRAM_START          (0x0100)                               
#define IRAM_SIZE           (0x0200)                               
#define IRAM_PAGE_SIZE      (0x0001)                               
#define IRAM_END            (IRAM_START + IRAM_SIZE - 1)           

